//Task: Ввести число от 1 до 12.
// Вывести на консоль название месяца, соответствующего данному числу.
// Осуществить проверку корректности ввода чисел.

import java.util.Scanner;

public class MonthNumber {

    public void checkMonth() {

    }

    public static void main(String[] args) {
        Scanner inputNumber = new Scanner(System.in);
        System.out.println(": ");
        //number = Integer.parseInt(inputNumber.next());
    }
}
